back/app/User.php

update `users` set `token_last_used` = '2018-08-16 11:31:02', `updated_at` = '2018-08-16 11:31:02' where `id` = '3'
---
    public function login()
    {
        try {
            auth()->login($this);
            $this->setTokenLastUser()->save();