back/app/Http/Controllers/Auth/LoginController.php

    public function login(string $token)
    {
        $user = User::where('token', $token)->first();
---
select * from `users` where `token` = 'verkl5' limit 1